apache/nuttx/arch/arm/src/stm32l4/stm32l4_can.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_can.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32.h"
#include "stm32l4_can.h"

#if defined(CONFIG_CAN) && defined(CONFIG_STM32L4_CAN1)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Delays *******************************************************************/

/* Time out for INAK bit */

#define INAK_TIMEOUT 65535

/* Mailboxes ****************************************************************/

#define CAN_ALL_MAILBOXES (CAN_TSR_TME0 | CAN_TSR_TME1 | CAN_TSR_TME2)

/* Bit timing ***************************************************************/

#define CAN_BIT_QUANTA (CONFIG_STM32L4_CAN_TSEG1 + CONFIG_STM32L4_CAN_TSEG2 + 1)

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_STM32L4_CAN_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_can_s
{
  uint8_t  port;     /* CAN port number (1 or 2) */
  uint8_t  canrx[2]; /* CAN RX FIFO 0/1 IRQ number */
  uint8_t  cantx;    /* CAN TX IRQ number */
  uint8_t  filter;   /* Filter number */
  uint32_t base;     /* Base address of the CAN control registers */
  uint32_t fbase;    /* Base address of the CAN filter registers */
  uint32_t baud;     /* Configured baud */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN Register access */

static uint32_t stm32l4can_getreg(struct stm32_can_s *priv,
                                  int offset);
static uint32_t stm32l4can_getfreg(struct stm32_can_s *priv,
                                   int offset);
static void stm32l4can_putreg(struct stm32_can_s *priv, int offset,
                              uint32_t value);
static void stm32l4can_putfreg(struct stm32_can_s *priv, int offset,
                               uint32_t value);
#ifdef CONFIG_STM32L4_CAN_REGDEBUG
static void stm32l4can_dumpctrlregs(struct stm32_can_s *priv,
                                    const char *msg);
static void stm32l4can_dumpmbregs(struct stm32_can_s *priv,
                                  const char *msg);
static void stm32l4can_dumpfiltregs(struct stm32_can_s *priv,
                                    const char *msg);
#else
#  define stm32l4can_dumpctrlregs(priv,msg)
#  define stm32l4can_dumpmbregs(priv,msg)
#  define stm32l4can_dumpfiltregs(priv,msg)
#endif

/* Filtering (todo) */

#ifdef CONFIG_CAN_EXTID
static int  stm32l4can_addextfilter(struct stm32_can_s *priv,
                                    struct canioc_extfilter_s *arg);
static int  stm32l4can_delextfilter(struct stm32_can_s *priv,
                                    int arg);
#endif
static int  stm32l4can_addstdfilter(struct stm32_can_s *priv,
                                    struct canioc_stdfilter_s *arg);
static int  stm32l4can_delstdfilter(struct stm32_can_s *priv,
                                    int arg);

/* CAN driver methods */

static void stm32l4can_reset(struct can_dev_s *dev);
static int  stm32l4can_setup(struct can_dev_s *dev);
static void stm32l4can_shutdown(struct can_dev_s *dev);
static void stm32l4can_rxint(struct can_dev_s *dev, bool enable);
static void stm32l4can_txint(struct can_dev_s *dev, bool enable);
static int  stm32l4can_ioctl(struct can_dev_s *dev, int cmd,
                             unsigned long arg);
static int  stm32l4can_remoterequest(struct can_dev_s *dev,
                                     uint16_t id);
static int  stm32l4can_send(struct can_dev_s *dev,
                            struct can_msg_s *msg);
static bool stm32l4can_txready(struct can_dev_s *dev);
static bool stm32l4can_txempty(struct can_dev_s *dev);

/* CAN interrupt handling */

static int  stm32l4can_rxinterrupt(int irq, void *context, int rxmb);
static int  stm32l4can_rx0interrupt(int irq, void *context,
                                    void *arg);
static int  stm32l4can_rx1interrupt(int irq, void *context,
                                    void *arg);
static int  stm32l4can_txinterrupt(int irq, void *context,
                                   void *arg);

/* Initialization */

static int  stm32l4can_enterinitmode(struct stm32_can_s *priv);
static int  stm32l4can_exitinitmode(struct stm32_can_s *priv);
static int  stm32l4can_bittiming(struct stm32_can_s *priv);
static int  stm32l4can_cellinit(struct stm32_can_s *priv);
static int  stm32l4can_filterinit(struct stm32_can_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_ops_s g_canops =
{
  .co_reset         = stm32l4can_reset,
  .co_setup         = stm32l4can_setup,
  .co_shutdown      = stm32l4can_shutdown,
  .co_rxint         = stm32l4can_rxint,
  .co_txint         = stm32l4can_txint,
  .co_ioctl         = stm32l4can_ioctl,
  .co_remoterequest = stm32l4can_remoterequest,
  .co_send          = stm32l4can_send,
  .co_txready       = stm32l4can_txready,
  .co_txempty       = stm32l4can_txempty,
};

#ifdef CONFIG_STM32L4_CAN1
static struct stm32_can_s g_can1priv =
{
  .port             = 1,
  .canrx            =
  {
                      STM32_IRQ_CAN1RX0,
                      STM32_IRQ_CAN1RX1,
  },
  .cantx            = STM32_IRQ_CAN1TX,
  .filter           = 0,
  .base             = STM32_CAN1_BASE,
  .fbase            = STM32_CAN1_BASE,
  .baud             = CONFIG_STM32L4_CAN1_BAUD,
};

static struct can_dev_s g_can1dev =
{
  .cd_ops           = &g_canops,
  .cd_priv          = &g_can1priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32l4can_getreg
 * Name: stm32l4can_getfreg
 *
 * Description:
 *   Read the value of a CAN register or filter block register.
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef CONFIG_STM32L4_CAN_REGDEBUG
static uint32_t stm32l4can_vgetreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              caninfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

